[
    {
        "number": 1,
        "title": "Приглашение к участию в русском переводе WCAG 2.1",
        "author": "ifap",
        "link": "https://habr.com/en/news/488864/",
        "annotation": "Привет! Я приглашаю вас поучаствовать в работе над переводом норматива Консорциума Всемирной паутины (World Wide Web Consortium, W3C) – Руководства по обеспечению доступности веб-контента (Web Content Accessibility Guidelines, WCAG) редакции 2.1.\n\r\nРуководство – это набор рекомендаций по обеспечению доступности веб-контента для людей с различными ограничениями, которые (рекомендации) фактически являются международным стандартом в этой области. Предыдущая редакция (WCAG 2.0) – является стандартом буквально – это ISO/IEC 40500:2012 Information technology. W3C Web Content Accessibility Guidelines (WCAG) 2.0.\n\r\nОригинальный текст на английском, черновой перевод на русский уже выполнен, но одна голова – хорошо, а много – лучше."
    },
    {
        "number": 2,
        "title": "Принята новая редакция Руководства по обеспечению доступности веб-контента – WCAG 2.2",
        "author": "ifap",
        "link": "https://habr.com/en/news/766282/",
        "annotation": "5 октября Консорциум Всемирной паутины (W3C) утвердил новую редакцию Руководства по обеспечению доступности веб-контента (Web Content Accessibility Guidelines) – WCAG 2.2 и в тот же день ОД «Информация для всех» опубликовало первый в мире перевод нормативной части новой редакции Руководства."
    },
    {
        "number": 3,
        "title": "Руководство по обеспечению доступности веб-контента (WCAG) 2.1 переведено на русский язык",
        "author": "ifap",
        "link": "https://habr.com/en/news/524626/",
        "annotation": "ОД «Информация для всех» опубликовало русский перевод Руководства по обеспечению доступности веб-контента (Web Content Accessibility Guidelines, WCAG) в редакции 2.1, разработанного Консорциумом Всемирной паутины (World Wide Web Consortium, W3C)."
    },
    {
        "number": 4,
        "title": "Стандарт доступности содержимого WAI-WCAG 1.0",
        "author": "rgbeast",
        "link": "https://habr.com/en/articles/28157/",
        "annotation": "О необходимости внедрения стандартов доступности сервисов и содержимого говорится в итоговой резолюции РИФ-2008, а в мировой практике такие стандарты существуют и используются более 10 лет. Следование рекомендациям по доступности содержимого WAI-WCAG (Web Accessibility Initiative Web Content Accessibility Guidelines) является одним из требований конкурса WebHiTech. В настоящей статье постараюсь перечислить рекомендации стандарта.\n\r\nWCAG 1.0 — стандарт, описывающий общие правила оформления страниц в интернете разработан в 1999 году подразделением WAI группы W3C. Цель стандарта — сделать содержимое интернета доступным всем пользователям, в том числе пользователям с ограниченными возможностями (например, лишенные зрения пользователи используют для работы в интернет специальные программы, зачитывающие содержимое сайтов). Стандарт описан в виде гайдлайнов, содержащих перечень контрольных точек, разделенных на три группы по приоритету:"
    },
    {
        "number": 5,
        "title": "Что WCAG грядущий нам готовит?",
        "author": "ifap",
        "link": "https://habr.com/en/articles/752664/",
        "annotation": "Этой осенью W3C, вероятно, утвердит наконец текст новой редакции Руководства по обеспечению доступности веб-контента (WCAG) – версии 2.2. Какие изменения ожидаются по сравнению с действующей редакцией 2.1? Желаете обсудить их или принять участие в переводе новой редакции на русский?"
    },
    {
        "number": 6,
        "title": "Чек-лист: проверяем веб-страницы на соответствие стандартам WCAG",
        "author": "kmoseenk",
        "link": "https://habr.com/en/companies/otus/articles/856172/",
        "annotation": "При создании этого чек-листа из 64 пунктов в качестве точки отсчёта использовался WCAG — Руководство по обеспечению доступности веб-контента (универсальный стандарт). Решение вопросов, указанных в этом чек-листе, поможет улучшить восприятие сайта для всех его пользователей."
    },
    {
        "number": 7,
        "title": "Делаем онлайн-кинотеатр для слепых (WCAG 2.0 AAA)",
        "author": "gsuvorov",
        "link": "https://habr.com/en/articles/250539/",
        "annotation": "В РФ живет около 275 тысяч слепых и слабовидящих людей, 22% молодежь, некоторые из них также являются пользователями интернета, как и мы. \n\r\nВ этой статье я поделюсь с вами инструментами и необычным опытом, который можно получить при создании онлайн-кинотеатра для слабовидящих людей.\n\n\r\n (пример адаптированной темы на GitHub по ссылке с картинки )"
    },
    {
        "number": 8,
        "title": "Вышло Руководство по применению WCAG 2.0 для информационных и коммуникационных технологий вне веб",
        "author": "Tseikovets",
        "link": "https://habr.com/en/articles/192782/",
        "annotation": "Рабочая группа Руководства по обеспечению доступности веб-контента (WCAG) 2.0 опубликовала в качестве информационного примечания W3C Руководство по применению WCAG 2.0 для информационных и коммуникационных технологий вне веб (WCAG2ICT)."
    },
    {
        "number": 9,
        "title": "Вышло официальное Руководство по обеспечению доступности Web-контента (WCAG) 2.0 на русском языке",
        "author": "Tseikovets",
        "link": "https://habr.com/en/articles/153419/",
        "annotation": "28 февраля 2013 года, после нескольких лет ожидания, наконец-то была опубликована финальная версия руководства по доступности Интернет-ресурсов WCAG версии 2.0 в уполномоченном русском переводе.\n\r\nОрганизатором перевода выступил Информационный центр ООН Россия, а координатором — Даниэль Новичков."
    },
    {
        "number": 10,
        "title": "Обеспечение доступности веб-контента: стандарты, критерии, пример реализации",
        "author": "pavelfargo",
        "link": "https://habr.com/en/companies/ispring/articles/564446/",
        "annotation": "Привет, меня зовут Павел. Я занимаюсь изучением и тестированием доступности.\n\r\nКогда начинал изучать этот вопрос, я понимал, что это делается с заботой о людях с нарушением зрения, слуха, моторики, но я не имел представления как именно это делается.\n\r\nПоэтому, в начале уходило много времени на поиск информации, затем на чтение документации, просмотр видео инструкций про доступность, на эксперименты с контентом, что, в итоге, помогло определиться с подходом и начать внедрять доступность в наши продукты.\n\r\nВ данной статье мы погрузимся в вопрос доступности контента, разберемся, почему важна доступность в интернете, чем она регламентируется и как реализуется. В завершение, я расскажу на реальном примере, как мы с командой работали над повышением доступности нашего продукта — конструктора онлайн-курсов iSpring Suite."
    },
    {
        "number": 11,
        "title": "Почему российские сайты не будут соответствовать ГОСТу по доступности",
        "author": "ifap",
        "link": "https://habr.com/en/articles/525100/",
        "annotation": "Закончив перевод Руководства по обеспечению доступности веб-контента (WCAG) 2.1 на русский язык, захотелось поговорить о языкознании, правоприменении, и поднять вынесенный в заголовок вопрос: почему российские сайты могут соответствовать WCAG, разработанным на его основе стандартам по доступности Евросоюза, США и даже Китая, но не национальному стандарту – ГОСТу?"
    },
    {
        "number": 12,
        "title": "Минцифры и очки",
        "author": "ifap",
        "link": "https://habr.com/en/articles/723444/",
        "annotation": "Результат 10-тилетних попыток Минцифры изобрести стандарт доступности веб-контента для госсектора укладывается в 3 абзаца корявого текста. Как гора рожала мышь и каковы ее творческие планы на ближайшее будущее?\n\n\nМинцифры изучает проблематику обеспечения доступности контента для инвалидов по зрению."
    },
    {
        "number": 13,
        "title": "Мифы о доступности цветового контраста",
        "author": "TheyMakeDesign",
        "link": "https://habr.com/en/articles/474400/",
        "annotation": "В сегодняшнее время растёт потребность дизайнеров в том, чтобы сделать интерфейсы доступными абсолютно для всех пользователей. Естественно, очень важно приспособить пользователей с ограниченными возможностями к пользованию такими интерфейсами, но в то же время рождается достаточно мифов касательно основ доступности цветового контраста и эти мифы увековечиваются дезинформированными людьми. Они часто повторяют и ретранслируют эти мифы, чтобы дискредитировать дизайн, не понимая, в каких ситуациях применяется тот или иной стандарт цветового контраста. Кроме того, они предполагают, что интерфейс является недоступным, когда для передачи информации используется цветовой контраст.\n\r\nИз-за этого дизайнеры часто зацикливаются на параметрах доступности дизайна для людей с ограниченными возможностями. Они вводят других в заблуждение, полагая, что их интерфейс недоступен, когда на самом деле он удовлетворяет требования доступности. Тезисы, содержащиеся в этой статье постараются развенчать распространенные мифы о доступности цветового контраста."
    },
    {
        "number": 14,
        "title": "Accessibility. Как сделать приложение доступным для пользователей с ограниченными возможностями",
        "author": "nukovtun",
        "link": "https://habr.com/en/companies/arcadia/articles/498476/",
        "annotation": "Обо мне\n\r\nМеня зовут Аня Ковтун, я UX/UI дизайнер и работаю в компании Arcadia с 2015 года. Помимо проектирования пользовательских интерфейсов, я общаюсь с заказчиками и занимаюсь составлением требований для команды разработчиков.\n\n\nПредыстория\nВ 2018 году я работала над одним масштабным проектом по автоматизации управления ресурсами для европейского рынка. Со стороны заказчика поступил запрос на внедрение accessibility при разработке следующих версий. На тот момент для меня этот термин (в контексте IT) был незнакомым, и после нескольких часов в гугле в моем блокноте появилось много судорожно выписанных вопросов:\nЧто такое accessibility? А как пользователи с ограниченными возможностями взаимодействуют с вебом? Пользуются специальными приложениями? Или могут воспринимать тот же контент, что и мы? Кто заботится о них? Кто является ответственным за то, чтобы они могли полноценно воспринимать контент? Как можно сделать контент доступным? Это сложно? Можем ли мы помочь?\nУже через пару месяцев я знала ответы на все эти вопросы и сейчас поделюсь этой информацией с вами. Меня удивляет: как получилось, что я так долго оставалась в неведении. Хочется сделать эту тему более популярной, чтобы таких, как я, было как можно меньше…"
    },
    {
        "number": 15,
        "title": "Почему вам не нужна версия для слабовидящих",
        "author": "glebmachine",
        "link": "https://habr.com/en/companies/oleg-bunin/articles/660691/",
        "annotation": "Представьте, что в кафе на застолье пришел веган. Его друзья, зная это, специально выбрали кафе с отдельным меню для веганов. Но в нем только макароны с кабачками и вишневый компот, а в обычном меню есть и картошка, и салаты и другая еда, в которой достаточно заменить пару ингредиентов, чтобы веган мог это есть. Естественно, гость в недоумении? Почему макароны с кабачками? Для чего вообще отдельное веганское меню?Это реальная история, которую рассказал мой друг Дима, проводя аналогию с версиями для слабовидящих. На самом деле раньше я тоже делала отдельную версию для слабовидящих и вбрасывала на сайт, совершенно не разбираясь в том, что такое доступность."
    },
    {
        "number": 16,
        "title": "О разработке специальной версии сайта Госдумы для людей с нарушениями зрения",
        "author": "muxx",
        "link": "https://habr.com/en/articles/134898/",
        "annotation": "Из серии статей о новинках на сайте Государственной Думы. Предыдущие: первая, вторая и третья.\n\r\nВ начале декабря была запущена специальная версия сайта Госдумы для людей с нарушениями зрения. Нам хотелось бы поделиться информацией об особенностях разработки такого рода сайтов.\n\r\nАдрес спецверсии: spec.duma.gov.ru\n\r\nВсю разработку специальной версии можно логически разделить на 4 этапа:\nАнализ действующих стандартов и ГОСТ-ов;\nАнализ существующих решений;\nОбобщение проанализированных данных;\nРазработка сайта.\nНо вначале, приведем некоторые цифры по проблеме зрения в России и мире."
    },
    {
        "number": 17,
        "title": "Есть ли порох в пороховницах? Hackathon Radio Canada 2018 (Часть вторая — боевая готовность)",
        "author": "dzsysop",
        "link": "https://habr.com/en/articles/352874/",
        "annotation": "Это вторая часть моего повествования (искренне думал что последняя).\n\r\nПервая часть здесь.\nТретья частьТретья часть\n\n\n\n\r\nИтак, формально команда сформирована. Хотя никто никого еще не знает. Цель проекта не определена. Radio Canada обещают предоставить некий API за неделю до события, чтобы у участников было какое-то время на ознакомление."
    },
    {
        "number": 18,
        "title": "Joomla 4 – шаблон Cassiopeia – советы и хитрости",
        "author": "sergeytolkachyov",
        "link": "https://habr.com/en/articles/647399/",
        "annotation": "Обзор возможностей шаблона по умолчанию Joomla 4 - Cassiopeia, а так же советы по кастомизации. Демонстрация доступности сайта для слабовидящих, соответствущей международным стандартам (WCAG 2.1) и их российским аналогам (ГОСТ Р 52872-2019). Анонс некоторых новых функций Joomla 4.1. Полезные ресурсы в конце статьи."
    },
    {
        "number": 19,
        "title": "CSS сolor-сontrast(): пошаговое руководство",
        "author": "honyaki",
        "link": "https://habr.com/en/companies/skillfactory/articles/721164/",
        "annotation": "Если вы испытывали раздражение из-за невозможности легко перемещаться по сайту, с высокой вероятностью вы столкнулись с недоступностью в том или ином виде. Недоступность и неприятные впечатления от использования схожи. Если вам сложно прочитать мелкий шрифт, то человеку с нарушениями зрения, возможно, вообще не прочитает его.\nФункция color-contrast() используется для удобства чтения, придания необходимого контраста между текстом и фоном на веб-странице. Это особенно важно для людей с нарушениями зрения, которым трудно прочитать текст с низким контрастом."
    },
    {
        "number": 20,
        "title": "Не лайтхаусом единым: как проверить свой сайт со всех сторон",
        "author": "host_m",
        "link": "https://habr.com/en/companies/vdsina/articles/522932/",
        "annotation": "Когда мы говорим о веб-валидаторах и оптимизации сайта под них, мы чаще всего имеем ввиду Lighthouse/Pagespeed Insights от Google, который давно стал де-факто стандартом для оценки производительности сайта. Кто-то стремится к заветным 100 баллам даже на прототипах и шаблонных приложениях в две кнопки, кто-то в шутку создает абсолютно недоступный сайт с идеальным рейтингом, но для всех фронтендеров лайтхаус предоставляет вменяемую, хоть и довольно поверхностную, аналитику производительности сайта и поиск бутылочных горлышек. Однако скорость загрузки — лишь один из множества параметров, которые стоит проверять на своём сайте, и для большинства других есть свои валидаторы и скоринговые алгоритмы. Мы рассмотрим инструменты для каждого из значимых направлений и составим список, по которому стоит прогонять свой сайт, чтобы в дальнейшем не отлавливать проблемы вручную."
    },
    {
        "number": 21,
        "title": "Проектирование доступных цветовых систем",
        "author": "TheyMakeDesign",
        "link": "https://habr.com/en/articles/472410/",
        "annotation": "Цветовой контраст является важным аспектом доступности в дизайне продукта. Хорошая контрастность облегчает использование продуктов людьми с нарушениями зрения и помогает в несовершенных условиях, таких как слабое освещение или старые экраны. Имея это в виду, мы недавно обновили цвета в наших пользовательских интерфейсах, чтобы сделать их более доступными. В переводе этой статьи сотрудники Stripe рассказывают о том, как они решали эту проблему, чем руководствовались и к чему в итоге пришли."
    },
    {
        "number": 22,
        "title": "Как создать палитру, комфортную для всех",
        "author": "m1rko",
        "link": "https://habr.com/en/articles/444868/",
        "annotation": "Вот палитра нашего сервиса Envoy. Как и многие цветовые схемы в вебе, она включает фирменный цвет (красный), информационный цвет (синий), цвет успешной операции (зелёный), цвет предупреждений (жёлтый) и разные оттенки серого.\n\r\nХотя эти цвета кажутся прекрасной палитрой, со временем мы поняли, что они недостаточно гибки для всех потребностей нашего пользовательского интерфейса. В отзывах постоянно всплывал один и тот же комментарий: «Текст недостаточного контрастный»."
    },
    {
        "number": 23,
        "title": "Инклюзивность и цифровая доступность в дизайне: почему это важно для всех",
        "author": "julia_alekhina",
        "link": "https://habr.com/en/companies/agima/articles/803317/",
        "annotation": "Всем привет! Меня зовут Юля Алёхина, я дизайнер в AGIMA. В этой статье поговорим об инклюзивном дизайне, о том, почему он касается не только людей с инвалидностью и как правильно аргументировать важность доступности в общении с заказчиком. Еще расскажу, как наш дизайн-отдел учился работать с доступностью, о наших новых целях и планах на будущее."
    },
    {
        "number": 24,
        "title": "WAI-ARIA: стандарт доступности активных интернет-приложений",
        "author": "rgbeast",
        "link": "https://habr.com/en/articles/40730/",
        "annotation": "WAI-ARIA (Web Accessibility Initiative — Accessible Rich Internet Applications) — стандарт доступности активных Интернет-приложений, определяет подходы к тому, чтобы сделать содержимое сайтов и интернет-приложения более доступными для людей с ограниченными возможностями. Настоящая статья описывает проблемы, решению которых посвящен стандарт WAI-ARIA, а также знакомит с пакетом технических документов WAI-ARIA. Используемая терминология описана в ранее опубликованной на хабре статье «Стандарт доступности содержимого WAI-WCAG 1.0».\n\r\nПрименение стандарта особенно эффективно для сайтов с динамическим содержимым и развитыми элементами управления пользовательским интерфейсом, разработанными с использованием Ajax, HTML, JavaScript, и связанных с ними технологий. В настоящее время, некоторые функциональные возможности веб-сайтов недоступны для части пользователей с ограниченными физическими возможностями, особенно для людей, полагающихся на программы, читающие с экрана и для тех людей, которые не могут использовать мышь. WAI-ARIA задает новые пути предоставления функциональных возможностей программами-помощниками. С помощью WAI-ARIA разработчики могут создавать прогрессивные веб-приложения, доступные и удобные для всех пользователей."
    },
    {
        "number": 25,
        "title": "Записи с конференции Web Standards Days — Москва 2015",
        "author": "kichik",
        "link": "https://habr.com/en/companies/microsoft/articles/276307/",
        "annotation": "ИконкиИконка кремля — Kremlin by parkjisun from the Noun Project\nЛоготипы WSD — github.com/web-standards-ru\n\r\nВ декабре мы помогали нашим друзьям из сообщества Веб-стандарты организовывать московскую конференцию серии Web Standards Days. Сегодня мы рады предложить вашему вниманию записи конференции и результаты опроса участников конференции об их предпочтениях в выборе технологий и инструментов разработки.\n\n\nОткрытие — Вадим Макеев (Opera)"
    },
    {
        "number": 26,
        "title": "Есть ли порох в пороховницах? Hackathon Radio Canada 2018 (Часть третья — На Старт! Внимание! Марш!)",
        "author": "dzsysop",
        "link": "https://habr.com/en/articles/353058/",
        "annotation": "Представляю вам третью часть моего, немного затянувшегося, рассказа.\n\r\nПолучив положительную оценку первой и второй частей, я не хотел заставлять читателей ждать слишком долго, но жизнь и реальность вносит свои коррективы.\n\n\n\r\nЗа 2 дня до начала хакатона Radio Canada прислали письмо в котором сообщили, что нашей команде выделен ментор — Patrick Lévesque. Для меня это было несколько неожиданно, хотя, наверное, об этом что-то было написано на сайте и было сказано во время предварительной презентации. Видимо, я пропустил это мимо ушей. Так или иначе, это добавляло уверенности, что нам будет у кого попросить помощи в случае возникновения каких-либо вопросов.\n\r\nВторник, среда, четверг рабочей недели пролетели стремительно как всегда. Предвкушение приключения нарастало. И к пятнице достигло своего пика. Жена была предупреждена, что на выходные, начиная с пятницы, я выпадаю из жизни и исчезну с радаров.\n\r\nИтак после работы в пятницу я в боевом настроении направился снова в Дом Радио."
    },
    {
        "number": 27,
        "title": "Рекомендации по доступности страниц для людей с ограниченными возможностями",
        "author": "40in",
        "link": "https://habr.com/en/articles/110600/",
        "annotation": "Многие слышали о рекомендациях WAI-WCAG (Web Accessibility Initiative Web Content Accessibility Guidelines), призванных в частности помочь пользователям с ограниченными возможностями (например с дефектами или отсутствием зрения).\n\r\nНо, зачастую, он игнорируется или отправляется как backlog task в долгий ящик. Это кажется лишним, не востребованным, да и в принципе, что слепой будет делать у меня на сайте?\n\n\n\r\nЯ все же попробую немного обосновать «полезность» двумя словами.\r\nВо-первых, — это качество. Ваш сервис станет более удобным и простым в пользовании. \r\nА, во-вторых, это конкурентноспособность – целевую аудиторию расхватывают быстро, поэтому поиск новых ниш – задача первоочередная, это вам скажет любой маркетолог.\n\r\nВ моем же случае — это требование заказчика. Согласно Section 508 если я хочу продать продукт любому федеральному органу США – я должен поддерживать этот стандарт. \n\r\nМногие скажут, что вряд ли собираются что-то продавать правительству США, но в России такой стандарт тоже есть (ГОСТ Р 52872–2007) и никто не гарантирует, что завтра он вас/нас не коснется.\n\r\nСледует также отметить, что если вы уже следуете принципам корректной разметки (согласно w3c) и оптимизации для поисковых систем, то кардинальных изменений от вас не потребуется. \n\r\nВсё же приведу ряд рекомендаций которые покрывают значительную часть элементов разметки. Их можно взять на заметку и смело использовать при следующей верстке."
    },
    {
        "number": 28,
        "title": "Web без мышки",
        "author": "Compilerrr",
        "link": "https://habr.com/en/companies/netcracker/articles/273071/",
        "annotation": "Наверное, все при взгляде на этот экран мысленно переносят обе руки на клавиатуру. Да, тут можно было навигироваться без мышки и это было быстро и хорошо! Многие до сих пор используют подобные менеджеры (Total commander, Far etc).\n\r\nС другой стороны, почти на всех современных сайтах, порталах и решениях, построенных для веба, пользователь вынужден постоянно отрывать руки от клавиатуры, целиться мышкой в кнопку/иконку/поле, а затем опять возвращать руки на клавиатуру для ввода текста.\n\r\nКак же достичь удобства навигации без мышки в вебе?"
    },
    {
        "number": 29,
        "title": "Что такое дизайн-токены простыми словами",
        "author": "ux_advocate",
        "link": "https://habr.com/en/companies/domclick/articles/775066/",
        "annotation": "Я постарался придумать самое простое объяснение дизайн-токенов на примере житейских ситуаций. Что это такое, как работают и зачем они нужны — в этой статье.Про принципы наименований, экспорт токенов из фигмы и передачу токенов разработчикам."
    },
    {
        "number": 30,
        "title": "Опубликованы новые русские переводы документации W3C по web-доступности",
        "author": "Tseikovets",
        "link": "https://habr.com/en/news/461529/",
        "annotation": "Консорциум Всемирной паутины (W3C) в рамках программы Инициативы web-доступности (WAI), объединяющей стратегии, стандарты и вспомогательные ресурсы, призванные помочь сделать Интернет более доступным для людей с ограниченными возможностями, объявил о значительном расширении перечня переводов нормативных документов на различные языки. В общей сложности стало доступно более двадцати новых переводов, в том числе на русском и белорусском языках."
    },
    {
        "number": 31,
        "title": "Государственный сайт, доступный для людей с ограниченными возможностями (чек-лист доступности)",
        "author": "heller",
        "link": "https://habr.com/en/companies/design/articles/314910/",
        "annotation": "Введение\nВ рамках “Дизайна госсистем” мы создали для вас (разработчиков всех видов) чек-лист доступности сайта для людей с ограниченными возможностями, который нужно прибить над рабочим столом каждого дизайнера и фронтендера. Он подходит к любым проектам (совсем не только государственным) в нем нет ничего лишнего. В нем только исключительно важная, критичная и полезная информация.\r\nТак что печатайте, читайте и делитесь со своими коллегами.\r\nЭто крайне необходимые текст и знания."
    },
    {
        "number": 32,
        "title": "О важном: инклюзивность интерфейсов, в которой нуждаются",
        "author": "VictoriaKlimenko",
        "link": "https://habr.com/en/articles/839254/",
        "annotation": "Сегодня на повестке дня – инклюзивность. Посмотрим, что это такое, как исследования могут помочь повышению инклюзивности и какие вообще у неё есть преимущества. А еще поговорим о стандартах доступности. Это первая из нескольких статей, посвященных теме инклюзивности. Инклюзивность – не просто о доступностиОна о внимании и том, что никакая группа людей, сколь бы та ни была малочисленна, не должна оставаться незамеченной. Безусловно, в первую очередь речь идет о тех, кто имеет ту или иную инвалидность (я долго пыталась подобрать формулировку, но решила, что именно так будет правильней всего – инвалидность; не «ограниченных в возможностях», потому что такие люди и не должны чувствовать себя ограниченными, что касается их пользовательского опыта, и не «люди, нуждающиеся в особенном отношении», потому что отношение к ним должно быть такое же, как и ко всем прочим – человечное; мы, как люди, причастные к созданию интерфейсов, должны стремиться сделать его понятным и удобным всем без исключения людям, взять это в привычку). Инклюзивный дизайн может учитывать возраст и пол, экономическое положение и образование, географическое положение, язык и расу."
    },
    {
        "number": 33,
        "title": "Большой отчёт об изменениях в веб-доступности",
        "author": "Drm-a",
        "link": "https://habr.com/en/companies/deliveryclub/articles/538546/",
        "annotation": "В 2020 году, как никогда раньше, стала очевидна необходимость сделать цифровое пространство инклюзивным и доступным для всех. Из-за продолжающейся пандемии, которая осложнила личный доступ к услугам и перевела целые отрасли в онлайн, особенно сильно страдают люди с ограниченными возможностями. К тому же их количество с растет из-за долгосрочных последствий пандемии."
    },
    {
        "number": 34,
        "title": "Вышла Joomla 4",
        "author": "sergeytolkachyov",
        "link": "https://habr.com/en/news/573496/",
        "annotation": "Итак, в свой 16-й день рождения вышла CMS Joomla 4.0. Это действительно долгожданное событие, так как с момента предыдущей мажорной версии прошло 9 лет.В процессе работы добавлено множество новых функций, улучшена работа с кодом для разработчиков, добавлены новые сущности в CMS - процессы"
    },
    {
        "number": 35,
        "title": "Я попросил ChatGPT написать требования, и вот что получилось",
        "author": "Systems_Education",
        "link": "https://habr.com/en/news/704392/",
        "annotation": "Весь Интернет охватила эпидемия chatGPT — она поддерживает беседу, пишет стихи, придумывает сказки, составляет юридические претензии и ищет ошибки в коде. Я подумал — а сможет ли она составить бэклог или спроектировать API? Так как я последние 7 лет занимаюсь проектами в области edTech, я начал с бэклога для школьной LMS — системы управления обучением. Вот такой бэклог сгенерировала мне модель (здесь и далее я привожу текст так, как мне выдала модель, без правок):"
    },
    {
        "number": 36,
        "title": "QA и его роль в создании ресурсов для людей с ограниченными возможностями",
        "author": "Katamaranov",
        "link": "https://habr.com/en/companies/redmadrobot/articles/504110/",
        "annotation": "В этой статье хочу обратить внимание на то, что проблема доступности сайтов и приложений для людей с ограниченными возможностями здоровья стоит острее, чем кажется. Под катом список полезных инструментов для тестирования и микроаудит нескольких известных сайтов."
    },
    {
        "number": 37,
        "title": "Восприятие цвета в интерфейсе: почему мы видим его по-разному",
        "author": "nkomissarov",
        "link": "https://habr.com/en/companies/vk/articles/656933/",
        "annotation": "Про инклюзивность в интерфейсах и то, как дизайнеру учесть особенности цветового зрения.Привет! Меня зовут Николай Комиссаров, я руковожу командой дизайна Пульса (pulse.mail.ru) и медиапроектов в VK, а также занимаюсь социальными проектами компании. Недавно, работая над одним из своих продуктов, я обнаружил, что вижу цвет не так, как другие люди. Если смотрю только правым глазом — цвета более насыщенные, левым — тусклые, а если обоими глазами — цвет получается средним по насыщенности.В этой статье я делюсь базовой информацией об особенностях цветового зрения, а также полезными инструментами и ресурсами, которыми сам пользуюсь. Буду рад, если в комментариях продолжите тему своими знаниями и кейсами!"
    },
    {
        "number": 38,
        "title": "Доступный дизайн компонентов на примерах. Дизайнеру про ARIA-атрибуты, порядок фокуса и другое",
        "author": "Anadesign02",
        "link": "https://habr.com/en/companies/arcadia/articles/588118/",
        "annotation": "В статье я расскажу о том, как разрабатывать дизайн доступных (т. е. отвечающих требованиям доступности) компонентов, об основных руководствах по доступности и о ключевых моментах, на которые стоит обратить внимание, а именно: о порядке фокуса, о клавиатурном взаимодействии и об ARIA-атрибутах."
    },
    {
        "number": 39,
        "title": "Руководство по инструментам доступности",
        "author": "evil_me",
        "link": "https://habr.com/en/companies/htmlacademy/articles/572502/",
        "annotation": "Новичкам может быть сложно создать сайт, доступный лицам с ограниченными возможностями. Мы решили собрать в один материал обширный ассортимент инструментов, проверяющих доступность страниц — от одноразовых букмарклетов до полноценных приложений. Надеемся, он поможет вам погрузиться в мир создания доступных сайтов.Это перевод статьи Nic Chan «A Complete Guide To Accessibility Tooling» из журнала Smashing Magazine."
    },
    {
        "number": 40,
        "title": "Юзабилити Бюллетень. Выпуск № 27",
        "author": "dmitrysatin",
        "link": "https://habr.com/en/articles/48161/",
        "annotation": "Приняты новые стандарты доступности веб-контента WCAG 2.0 | Мария Чайкина: Юзабилити платежных терминалов | UPA MONTHLY — DECEMBER 2008 | Пользовательскому интерфейсу — 40 лет | Новогодний вебинар UX Russia — «Состояние потока» (Введение в тему)"
    },
    {
        "number": 41,
        "title": "<dl> или <table>? Исследуем подходы к представлению пар ключ-значение в HTML",
        "author": "Libiros",
        "link": "https://habr.com/en/articles/782622/",
        "annotation": "Казалось бы, простая задача - сверстать список пар ключ-значение. Бери <div> и делай. Но что, если захотелось подушнить? Этим и займёмся в статье...Рассмотрим три подхода к решению этой задачи: <div>, <dl>, <dt>, и <dd>, и <table>. Обсудим преимущества, недостатки и примеры. Цель - помочь выбрать наиболее подходящий подход для конкретной задачи."
    },
    {
        "number": 42,
        "title": "Как обеспечить цифровую доступность по всем правилам: опыт Яндекс Капчи",
        "author": "KonanPS",
        "link": "https://habr.com/en/companies/yandex/articles/826936/",
        "annotation": "Привет! Меня зовут Павел Конон, я аналитик в команде Антиробота в Яндексе. Занимаюсь развитием инструмента капчи в команде Антиробота. Думаю из названия команды понятно, что мы работаем над системой онлайн классификации источников запросов — робот или человек.Сегодня хочу рассказать о том, как мы решаем нетривиальную задачу: делаем нашу капчу более доступной для слабовидящих пользователей и при этом соблюдаем все требования безопасности и ГОСТ. С одной стороны нам нужно упростить прохождение капчи для людей с различными особенностями, с другой — оставить такую же сложность для роботов. Поэтому такие способы как упрощение заданий, проставление конкретному пользователю куки татем‑от‑капчи или возможность выбирать более подходящий тип задания, мы довольно быстро отклонили. И начали искать другие варианты."
    },
    {
        "number": 43,
        "title": "Юзабилити Бюллетень. Выпуск № 27",
        "author": "dmitrysatin",
        "link": "https://habr.com/en/articles/48161/",
        "annotation": "Приняты новые стандарты доступности веб-контента WCAG 2.0 | Мария Чайкина: Юзабилити платежных терминалов | UPA MONTHLY — DECEMBER 2008 | Пользовательскому интерфейсу — 40 лет | Новогодний вебинар UX Russia — «Состояние потока» (Введение в тему)"
    },
    {
        "number": 44,
        "title": "Доступные текстовые метки для всех",
        "author": "MaxRokatansky",
        "link": "https://habr.com/en/companies/otus/articles/560220/",
        "annotation": "Мое видео на тему «Специальные возможности в действии: практические советы по увеличению доступности пользовательских интерфейсов» уже доступно онлайн. Этот пост — дополненная расшифровка той части видео, где рассказывается, как создавать более информативные текстовые метки в виде кнопок и (или) ссылок, чтобы сделать покупки в Интернете более комфортными для пользователей программ экранного доступа и не нарушать рекомендаций по обеспечению доступности веб-контента (WCAG). Немаловажно, что тем самым мы не ломаем метки для пользователей голосового ввода. Описанные принципы подходят для всех видов текстовых меток, включая элементы управления формы."
    },
    {
        "number": 45,
        "title": "Адаптация сайта для пользователей с ограниченными возможностями — это не сложно",
        "author": "dimatwork",
        "link": "https://habr.com/en/companies/netcat/articles/165697/",
        "annotation": "Веб-разработчики к адаптации сайтов для слабовидящих (и других категорий людей с ограниченными возможностями здоровья) относятся двойственно. С одной стороны, я еще не встречал человека, который бы сказал «их слишком мало, чтобы тратить на них время»; с другой — в условиях фиксированных бюджетов и сжатых сроков именно так и случается. К тому же, тот факт, что для этого надо изучать какие-то правила, рекомендации, часто просто пугает. А между тем, большинство рекомендаций WCAG 2.0 от консорциума W3C (Web Content Accessibility Guidelines, Руководство по обеспечению доступности веб-контента) при ближайшем рассмотрении банально совпадают с правилами хорошего тона, рекомендациями для адаптации сайтов под мобильные устройства, да и просто не так уж и сложны в реализации. При этом следование этим рекомендациям упростит работу с сайтом не только не только пользователям с ограниченными возможностями здоровья, но и пользователям с ограниченными техническими возможностями (низкоскоростной Интернет; отсутствие мыши, как на смартфонах; маленький экран), а также пожилым людям. Поэтому я решил написать вольное изложение всех двенадцати положений WCAG 2.0, которое и предлагаю вашему вниманию."
    },
    {
        "number": 46,
        "title": "Чек-лист вёрстки. Что можно отдавать клиенту, а что надо переделывать",
        "author": "Delka",
        "link": "https://habr.com/en/articles/114256/",
        "annotation": "Вы PM. Как узнать – готова ли вёрстка к реальному использованию?\r\nВы заказчик. Как убедиться, что работа выполнена качественно?\r\nКак оценить качество вёрстки?\n\r\nКогда я стал тим-лидом, а позже PM, передо мной стала задача проверять вёрстку наших проектов. Нужно было выработать формальные, легкопроверяемые критерии, соответствие кода которым, должно было давать некую гарантию, что не будет факапов и ни клиент, ни программеры не сказажут потом “WTF?”.\n\r\nКлиенту неважно насколько красив ваш код, но ему важен результат. Качественный код нужен фирме, т.к. он надёжней и в будущем его будет легче поддерживать.\n\nТребования должны были быть такие, что соблюсти их легче, создавая качественную вёрстку, а не говнокод. Я составлял такой чек-лист в течении полутора лет. За последние полгода в него не добавилось ничего. Значит самое главное учтено.\n\r\nИтак что же это за список?\n\nКраткая версия теперь доступна на html5checklist.com (github), где можно вносить pull-request'ы.\n\nИстория обновлений:\n\n2015/08/11: Актуализировал рекомендации по оптимизации скорости загрузки. Добавил требование поддержки Retina. Дополнил «19. Мелочи» требованием что изображения должны масштабироваться в зависимости от размера окна.\n2015/08/10: актуализирован список исключений для CSSLint\n2015/07/29: актуализирован пункт №13 «плохо»/«хорошо»\n2015/04/08: добавлено требование использования препроцессоров и рекомендация использования систем сборки\n2013/04/25: добавлены анализаторами качества кода: CSSLint и JSHint, указан сайт подбора css font stack (спасибо  @fliptheweb), мелкие уточнения (работу интерактивных элементов страницы, что не пропадает фон на высоких разрешениях, не должно быть пустых презентационных блоков, при проверках контента — пробовать удалять заголовки, менять местами блоки)\n2013/04/24: добавил пункт об минимизации каскада (БЭМ-техники, MCSS, SMACSS), необходимости вписывания в экран моб. устройства, заменил ссылку на проверочный текст отображения стандартного html на код с normalize.css, поправил пример где в рекомендации встречался длинный каскад, упомянул про Opera на Presto и новый уровень семантики — в именах классов BEM.\n2012/04/12: отсортировал пункты проверки в порядке важности, выделил главные, дополнил статью подробностями\n2011/12/07: дополнил согласно доклада на WSD Минск'2011.\n2011/07/19: добавлено про повышение надёжности вёрстки благодаря html5-тэгам, про необходимость favicon/apple-touch-icon, отсутствие багов при ресайзе textarea\n2011/06/15: добавил пояснения какие ошибки валидации допустимы, рассказал про отсутствие официальной кнопки «HTML5 Valid» и про официальное лого HTML5 на сайте."
    },
    {
        "number": 47,
        "title": "Роль UX/UI-дизайна в процессах автоматизации бизнеса на примере оформления ипотеки",
        "author": "tdsgn",
        "link": "https://habr.com/en/articles/729688/",
        "annotation": "В этой статье рассказываем, как мы искали где оформить ипотеку. И как нашли кейс, на примере которого показали как можно улучшить юзабилити формы заявки на сайте с точки зрения UX/UI и автоматизации."
    },
    {
        "number": 48,
        "title": "Недоступный веб: как мы развели такой бардак",
        "author": "alexey-m-ukolov",
        "link": "https://habr.com/en/articles/309076/",
        "annotation": "Теоретически, любой может пользоваться вебом. В реальности — люди с ограниченными возможностями остаются за бортом.\n\r\nЯ решил перевести эту статью, потому что полностью согласен с тем, что в ней написано: реализация стандартов доступности находится на очень низком уровне и нам нужно начать менять эту ситуацию. Миша предлагает реальные шаги, которые нужно предпринимать каждому участнику процесса разработки, и говорит о том, почему это нужно делать.\n\r\nО том, насколько печальна ситуация, можно судить по результатам опроса, который я проводил ранее: проблемой доступности вообще не занимаются 84% ответивших. Ещё 12% пытаются делать сайты доступными, но признают, что делают не всё или не так. И только 2% уделяют должное внимание адаптации сайта для людей с ограниченными возможностями.\r\nЧестно говоря, я думал, что в других странах с этим лучше, но, судя по статье, там всё так же плохо как и у нас.\n\r\nДавайте делать веб доступным для всех, коллеги — это важно!"
    },
    {
        "number": 49,
        "title": "Работа над доступностью: с чего начать, куда копать, как оценить прогресс",
        "author": "Flamyatina",
        "link": "https://habr.com/en/companies/rtlabs/articles/770272/",
        "annotation": "Допустим, вы уже прониклись важностью обеспечения доступности ваших сервисов, закатали рукава и готовы взяться за работу. С чего же начать? Сделать методички для дизайнеров? Протестировать свои продукты на пользователях с нарушениями зрения? Отправить всех разработчиков читать материалы по доступной разработке?Что вам действительно важно, если вы занялись доступностью? Вам важны работающие доступные сервисы, поэтому начать надо с решения конкретных проблем. Вам нужны быстрые победы. Много и недорого."
    },
    {
        "number": 50,
        "title": "Как создать устойчивую и гармоничную систему отступов в дизайне для более быстрой разработки",
        "author": "iloveip",
        "link": "https://habr.com/en/companies/iloveip/articles/342952/",
        "annotation": "Перевод «Я люблю ИП»\nНедавно я работала над созданием системы отступов и размеров для одного продукта в сфере здравоохранения, чтобы улучшить читабельность текста и добиться последовательности на всех страницах. Я вывела три правила для отступов (Правило трёх «К») и четыре размера (16px, 8px, 4px, 2px), которые работали гармонично с новой системой типографики.\nИз этой статьи вы узнаете, как использовать расстояния осознанно для последовательности в дизайне и более быстрой разработки."
    },
    {
        "number": 51,
        "title": "Как я правил контраст и базовую палитру в дизайн-системе",
        "author": "APPKODE",
        "link": "https://habr.com/en/articles/840804/",
        "annotation": "Меня зовут Игорь Пешков, я дизайнер в KODE — IT-компании, которая занимается коммерческой разработкой. Хочу рассказать вам, как исправлял проблемы с контрастом в дизайн-системе одной крупнейшей в своей области экосистемы IT-продуктов (сами понимаете — NDA). Этот материал — обобщение и описание практического опыта. Теории здесь минимум, так что в первую очередь это будет полезно новичкам в работе с дизайн-системами и палитрами. Но надеюсь, что бывалые опытные дизайнеры тоже найдут здесь что-то полезное. Или хотя бы лишний раз в чём-то убедятся)"
    },
    {
        "number": 52,
        "title": "Семь простых правил, чтобы сделать Интернет доступным для всех",
        "author": "nanton",
        "link": "https://habr.com/en/companies/productivity_inside/articles/417589/",
        "annotation": "Под доступностью в цифровой среде понимают практики для создания цифрового контента и приложений, которые были бы пригодны для использования широким кругом людей, включая и тех, кто страдает нарушениями зрения, двигательных функций, слуха, речи или же когнитивных способностей.\n\n\n\r\nСуществует ложное убеждение, что сделать сайт доступным можно только вложив много сил и средств, но это вовсе не обязательно. Если проектировать проект с самого начала с учетом соответствующих требований, добавлять какие-то особые функции и контент не понадобится, а значит, не будет и дополнительных затрат.\n\r\nЕсли же речь идет о том, чтобы исправить погрешности на уже имеющемся сайте, то здесь придется приложить некоторые усилия. Когда я работал в компании Carbon Health, мы как-то раз проверили сайт на доступность при помощи особого расширения в Chrome. Уже на главной странице обнаружилось 28 нарушений, которые необходимо было устранить. На первый взгляд показалось, что это будет очень трудоемкий процесс, но вскоре выяснилось, что внести правки будет не так уж и сложно — нужно только вложить время и разобраться в основах. Нам удалось свести количество нарушений к нулю всего за пару дней.\n\r\nЯ хочу поделиться некоторыми простыми шагами, которые мы предприняли и которые возможно, помогут и вам. Эти принципы рассчитаны, в первую очередь, на мобильные и веб-приложения. Но прежде чем начать, давайте выясним, зачем это нужно."
    },
    {
        "number": 53,
        "title": "Обзор российского законодательства в сфере web доступности",
        "author": "kranid",
        "link": "https://habr.com/en/articles/440648/",
        "annotation": "Мне не раз доводилось сталкиваться с мнением, что доступность государственных сайтов закреплена законодательно, но при этом частные web ресурсы это некоим образом не касается, однако, в действительности, не все так однозначно. Этот пост — результат попытки разобраться с данным вопросом до конца и расставить все точки над i."
    },
    {
        "number": 54,
        "title": "Chrome будет показывать разработчикам, как их сайты выглядят для пользователей с нарушениями зрения",
        "author": "AnnieBronson",
        "link": "https://habr.com/en/news/492080/",
        "annotation": "Браузер Google Chrome запустил новый инструмент, который поможет разработчикам увидеть, как пользователи с различными нарушениями зрения воспринимают их сайты. Видеодемонстрацию нового раздела опубликовал в твиттере сотрудник Google Матиас Байнс."
    },
    {
        "number": 55,
        "title": "Как упаковать три больших банка в один сайт",
        "author": "VTB",
        "link": "https://habr.com/en/companies/vtb/articles/358770/",
        "annotation": "До недавнего времени сайт vtb.ru вполне отвечал требованиям банка ВТБ. Но после присоединения Банка Москвы и ВТБ24 он стал охватывать только небольшой сегмент разросшегося массива продуктов и услуг. Собственные сайты Банка Москвы и ВТБ24 должны были со временем прекратить свое существование. Поэтому нам нужно было придумать, как соединить всю информацию, чтобы пользователь четко понимал, что происходит у него на дисплее. В этом посте мы расскажем, как решили эту задачу и пришли к обновленному vtb.ru, запущенному в начале года."
    },
    {
        "number": 56,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №428 (10 — 16 августа 2020)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/515378/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 57,
        "title": "Про хороший и плохой дизайн для недизайнеров",
        "author": "Anadesign02",
        "link": "https://habr.com/en/companies/arcadia/articles/525144/",
        "annotation": "Что нужно пользователю от сайта? Чтобы нужная информация находилась легко, как рыбка в аквариуме. Дизайн в первую очередь должен решать проблемы пользователя. Я часто сталкиваюсь с нарушением UX-принципов в программных продуктах, поэтому хочу помочь менеджерам, начинающим дизайнерам и программистам освоить базовые принципы юзабилити, а также научиться распознавать распространённые ошибки."
    },
    {
        "number": 58,
        "title": "Ответы на вопросы о создании главного сайта страны",
        "author": "afitiskin",
        "link": "https://habr.com/en/articles/77558/",
        "annotation": "Совсем недавно я анонсировал конференцию с Артемом Геллером о создании сайта kremlin.ru. Конференция прошла в минувшую среду (2 декабря). Все желающие имели возможность задать Артему вопрос. Сама конференция доступна у нас в архиве, а здесь я опубликую часть наиболее интересных на мой взгляд вопросов и ответов."
    },
    {
        "number": 59,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №451 (18 — 24 января 2021)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/538972/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 60,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №453 (1 — 7 февраля 2021)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/541296/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 61,
        "title": "Контрастность компонентов: работа над ошибками",
        "author": "dyakonov_design",
        "link": "https://habr.com/en/companies/elama/articles/565198/",
        "annotation": "Привет, я Антон, UX-дизайнер. Работаю над библиотекой компонентов eLama. Расскажу о том, как мы обнаружили один из недостатков библиотеки и как его исправили.Когда мы начали работать над компонентами, изначально мы уделили мало внимания контрастности. Поняли мы это быстро благодаря отзывам от недовольных пользователей.   Мы не учли, что цветопередача мониторов, условия работы и особенности зрения пользователей довольно сильно отличаются, поэтому один не может отличить плейсхолдер от заполненного поля, а другой — разглядеть текст заблокированной кнопки."
    },
    {
        "number": 62,
        "title": "20 наиболее необходимых инструментов для проверки отображения сайта",
        "author": "Tsotsotka",
        "link": "https://habr.com/en/companies/aiken/articles/115704/",
        "annotation": "Доступность контента и отображение информации на сайте чрезвычайно важна. Говоря простым языком, что хорошего может сделать то, что находится у вас на сайте, если определенные люди не смогут увидеть это? Конечно, этот новый модный дизайн с мелким шрифтом и малоконтрастными цветами для вас и ваших друзей выглядит классно, но вот что насчет тех, у кого слабое зрение, или тех, кто не различает некоторые цвета, или тех, у кого какие-либо другие проблемы со зрением — они ведь просто не смогут ничего найти, не говоря уже о том, чтобы прочитать хоть что-нибудь на вашем сайте. Вам надо, даже не «надо», а вы ДОЛЖНЫ сделать свой сайт доступным для как можно большего числа посетителей.\n\r\nТолько вот, что же делать, чтобы гарантировать доступность своего сайта? После прочтения данной статьи ваша задача значительно упростится. Ниже вы найдете 20 инструментов, помогающих сделать сайт более доступным."
    },
    {
        "number": 63,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №501 (2 — 9 января 2022)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/599785/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 64,
        "title": "Доступ открыт: как в ЮMoney создают сервисы для людей с ограниченными возможностями",
        "author": "yooteam",
        "link": "https://habr.com/en/companies/yoomoney/articles/730190/",
        "annotation": "Как создавать сервисы, доступные всем: опыт ЮMoneyПривет, меня зовут Паша Ефремов, я фронтенд-разработчик в ЮMoney. Я работаю с accessibility, то есть с доступностью сервисов. Хочу рассказать, как мы в компании делаем сайты и приложения доступными для людей с ограниченными возможностями, какие комбинации кода для этого используем и какими инструментами поддерживаем accessibility."
    },
    {
        "number": 65,
        "title": "16 простых и эффективных правил дизайна UI",
        "author": "Bright_Translate",
        "link": "https://habr.com/en/companies/ruvds/articles/732942/",
        "annotation": "Проектировать пользовательский интерфейс сложно. Здесь есть множество возможных вариаций макета, отступов, типографики и цвета, в которых можно просто запутаться. А если к этому дополнительно прибавить юзабилити, доступность и принципы психологии, то задача становится ещё труднее.\n\r\nК счастью, дизайн UI не обязательно должен представлять такие сложности. Работая в качестве дизайнера продуктов более двух десятков лет, я понял, что большая часть моих решений в плане визуального представления и реализации взаимодействия определялись системой логических правил. Не художественным чутьём или магической интуицией, а простыми правилами. \n\r\nНаличие системы логических правил помогает эффективно принимать в дизайне продуманные решения. Без логической системы вы просто используете внутреннее чутьё, меняя компоновку элементов, пока не получится желаемый красивый результат.\n\r\nМне нравятся правила и логика, но в дизайне решения редко являются двоичными. Вместо строгих правил, которым вам необходимо следовать, воспримите приведённые далее рекомендации как руководства, которые прекрасно работают во многих случаях.\n\r\nСамый быстрый способ обучения — это практика, так что приступим!"
    },
    {
        "number": 66,
        "title": "Как работают глаза и что надо учитывать, создавая тёмную тему приложения",
        "author": "mkolchanova",
        "link": "https://habr.com/en/companies/ispmanager/articles/694412/",
        "annotation": "Тёмная тема — уже не просто тренд в дизайне, а правило хорошего тона. Позаботьтесь о комфорте пользователя, если вы уважаете его желание провести ночь с вашим приложением, вместо того, чтобы хорошо выспаться. Далеко не все пользуются тёмной темой, но однажды ослепнув от яркого монитора и обзаведясь очками, невольно переходишь на тёмную сторону. Так как же грамотно подойти к её созданию? Меня зовут Мария, я QA-инженер в ISPmanager и сегодня расскажу, как спроектировать и протестировать тёмную тему с учётом человеческой физиологии."
    },
    {
        "number": 67,
        "title": "Использование цвета в терминале",
        "author": "ilyachalov",
        "link": "https://habr.com/en/articles/681216/",
        "annotation": "Я пишу небольшие скрипты для работы в программах-оболочках «Windows PowerShell» версии 5.1 и «PowerShell» версии 7 в операционной системе «Windows 10». Иногда тянет подсветить текстовый вывод в консоль разными цветами. В этой статье я хочу рассказать о паре грабель, на которые можно при этом наступить."
    },
    {
        "number": 68,
        "title": "Как сделать большой продукт доступным",
        "author": "AlexChudd",
        "link": "https://habr.com/en/companies/wrike/articles/668268/",
        "annotation": "На первый взгляд создание доступной среды в цифровом продукте кажется простой задачей. В конце концов, что может быть проще, чем использовать нормальные кнопки вместо div? Но когда пытаешься масштабировать такой подход, все становится сложнее. В этой статье я начну с базовых компонентов (текстовые поля или попапы), а затем объясню, как сделать доступной целую платформу из множества разных приложений, которые написаны десятками разных команд."
    },
    {
        "number": 69,
        "title": "Руководство по alt-text от слабовидящего веб-разработчика",
        "author": "m1rko",
        "link": "https://habr.com/en/articles/341810/",
        "annotation": "Эта статья содержит всё, что вам нужно знать об alt-text! Когда их использовать и как идеально их подготовить. Подготовил я, Дэниель, веб-разработчик с частичной потерей зрения, который ежедневно использует скринридер.\n\n\n\nМой опыт с картинками в вебе\r\nВо время сёрфинга в вебе я использую сочетание увелителя экрана и скринридера. Как показывает практика, увеличение экрана удобнее на дисплеях большого размера, а скринридер — на меньших устройствах."
    },
    {
        "number": 70,
        "title": "Web Accessibility в рассказе «A11Y от 0 до NaN»",
        "author": "FenderIL",
        "link": "https://habr.com/en/articles/762186/",
        "annotation": "Данной статьёй я планирую рассказать про интересные случаи и про то, в каких ситуациях можно оказаться, постигая новые горизонты, но не собираюсь даже пытаться заменить справочники по aria-атрибутам и эталонным примерам доступных компонентов. Стандарт W3C полон полезной информации, которая сдержанно подает только нужное. Я же предостерегу вас от некоторых сомнительных решений, с которыми вы можете столкнуться, и постараюсь приблизить задачу доступности к стандарту, коим для нас сейчас является покрытие тестами и использование анализаторов кода."
    },
    {
        "number": 71,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №300 ( 29 января — 4 февраля 2018)",
        "author": "alexzfort",
        "link": "https://habr.com/en/companies/zfort/articles/348278/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 72,
        "title": "Доступность сервиса: встраивание в существующие процессы",
        "author": "Flamyatina",
        "link": "https://habr.com/en/companies/rtlabs/articles/747828/",
        "annotation": "На связи снова Таня Миронова — руководитель направления доступности Госуслуг в компании РТЛабс. Сегодня расскажу, как повысить доступность сервисов и встроить контроль в производственные процессы компании. Из моего опыта и общения с коллегами удалось выделить 3 базовых подхода к обеспечению доступности. Расскажу о каждом в отдельности, а потом о том, какой вариант мы выбрали для себя на Госуслугах."
    },
    {
        "number": 73,
        "title": "Влияние нефункциональных требований на разработку программного обеспечения",
        "author": "Demin_Konstantin",
        "link": "https://habr.com/en/companies/smartup_tech/articles/748150/",
        "annotation": "Все требования к программным продуктом можно разделить на две группы. Это функциональные и нефункциональные требования (НФТ). Первые описывают «что» нужно сделать, вторые — «как» должна работать система. Это условия, при которых продукт должен работать, и качества, которыми он должен обладать (например, производительность, надежность, масштабируемость). Они имеют большое значение, хотя напрямую и не описывают основные функции системы. От них зависит пользовательский опыт. Сегодня расскажем о трех интересных задачах из нашей практики, в которых НФТ играли решающую роль. Будем рады обсудить ваши задачи в комментариях. Увидимся под катом!"
    },
    {
        "number": 74,
        "title": "Есть ли порох в пороховницах? Hackathon Radio Canada 2018 (Часть первая, собираем команду)",
        "author": "dzsysop",
        "link": "https://habr.com/en/articles/352774/",
        "annotation": "В этой статье я хочу представиться, рассказать что толкнуло меня на участие, как я смог собрать команду, какие выводы для себя я вынес и просто поделиться своим опытом участия в моем первом хакатоне.\n\r\nИзвините коротко не получилось, текста много и не всё по теме.\n\n\n\r\nНадеюсь, это будет интересно читателям Хабра не столько с технической стороны, сколько просто с точки зрения расширения кругозора и желания узнать «а как оно там».\n\nПредисловие, где автор вспоминает то, что никому не интересноЯ уже давно не студент, но в мои студенческие годы не было ни хакатонов ни возможности особо выехать из страны и посмотреть «как оно там».\n\r\nСегодня я понимаю, что мир давно изменился и сейчас есть возможность поучаствовать где угодно и в чем угодно и, тем не менее, я думаю, что своего читателя эта статья должна найти."
    },
    {
        "number": 75,
        "title": "Почему интерфейс должен быть доступным для всех и как это сделать",
        "author": "Sberbank",
        "link": "https://habr.com/en/companies/sberbank/articles/352836/",
        "annotation": "Привет! Меня зовут Валерия Курмак, я ведущий аналитик пользовательского взаимодействия в Дизайн-центре Сбертеха и эксперт в accessibility. В статье я расскажу:\n\n\nкак мы делаем цифровые продукты Сбербанка равно доступными для всех;\nчто мы выяснили в результате исследования о людях с инвалидностью;\nс какими трудностями мы столкнулись при адаптации интернет-банка Сбербанк Онлайн и как их преодолели;\nкак мы распространяем знания и внедряем accessibility в процессы."
    },
    {
        "number": 76,
        "title": "Изменить цвета и кнопки сервиса — и не сломать дизайн-систему",
        "author": "Alexeyafonin",
        "link": "https://habr.com/en/companies/yandex_cloud_and_infra/articles/804941/",
        "annotation": "Меня зовут Алексей Афонин, я старший дизайнер продукта в Yandex Cloud. В прошлом году нам понадобилось полностью изменить внешний вид нашего сервиса для бизнес‑аналитики DataLens перед его выходом в опенсорс. Разработчики и дизайнеры интерфейсов часто сталкиваются с подобными задачами: есть уже работающий сервис, но его нужно стилизовать, например, в случае ребрендинга или при необходимости учесть специфический пользовательский опыт. В наших продуктах мы пользуемся дизайн‑системой и библиотекой компонентов Gravity UI — это проект Yandex Cloud, который не так давно тоже вышел в опенсорс. В этой статье я поделюсь опытом, как мы решили задачу «перекрашивания DataLens» с её помощью. Но даже если вы не используете DataLens и ещё не знакомы с Gravity UI, наши наработки могут пригодиться командам разработчиков и дизайнеров, которые хотят стилизовать свои продукты быстрее и удобнее."
    },
    {
        "number": 77,
        "title": "200 лет шрифту Брайля: как себя сегодня чувствуют ассистивные технологии в сети?",
        "author": "olegantipovDDG",
        "link": "https://habr.com/en/companies/ddosguard/articles/822625/",
        "annotation": "В 1824 году 15-летний незрячий французский мальчик Луи Брайль изобрел рельефный шрифт, которым сегодня пользуются люди с нарушениями зрения по всему миру. Так появилась первая полноценная ассистивная технология в истории. В этой статье я расскажу, какие еще технологии подобного рода у нас есть сегодня в цифровом мире — в котором так многое зависит от способности видеть, читать и кликать."
    },
    {
        "number": 78,
        "title": "Становимся дальтониками: эксперимент в сопереживании",
        "author": "m1rko",
        "link": "https://habr.com/en/articles/417421/",
        "annotation": "Сопереживание. Эмпатия. Словечко стало модным в отрасли, поскольку всё больше компаний стремятся идти навстречу клиентам. Поначалу это вроде легко, но со временем владельцы бизнеса, отраслевые эксперты и последние данные могут вас загрузить — и отвлечь от сопереживания обычному пользователю.\n\nКак дизайнеры UX, мы обязаны всегда ставить потребности и желания других выше своих собственных при планировании и разработке интерфейсов.\r\nВ свете этого я решила провести эксперимент по эмпатии и понять, каково это — быть на чужом месте. В частности, на месте моего коллеги Питера."
    },
    {
        "number": 79,
        "title": "10 инструментов проверки контраста вашего дизайна для улучшения его „читабельности“",
        "author": "alexbig",
        "link": "https://habr.com/en/articles/31250/",
        "annotation": "Вашему вниманию предлагается перевод статьи 10 colour contrast checking tools to improve the accessibility of your design от Roger Johansson. Перевод alexbig\n\n10 инструментов проверки контраста вашего дизайна для улучшения его „читабельности“\n\r\nВ моей повседневной работе мы создаём графический дизайн для большинства сайтов наших клиентов, но не для всех. Некоторые из них сами или с помощью дизайн студий делают визуальный дизайн и оставляют переход на HTML + CSS + JavaScript и CMS для нас. Когда такое происходит, я практически всегда сталкиваюсь с проблемами недостаточного цветового контраста в дизайне. Иногда эти проблемы достаточно второстепенные и допустимые, но зачастую, есть области, которые необходимо скорректировать.\n\r\nЕсли вам интересно, почему меня волнует (и почему я думаю, что вы должны заботиться о) цветовом контрасте веб-сайта — очень просто. Если текст не имеет достаточного контраста со своим фоном — у людей возникнут проблемы. Все, кто страдает дальтонизмом или те, кто бороздят Веб не в идеальных условиях (плохой монитор, отражение окон, блики от солнца) не смогут прочитать текст, по крайней мере, без трудностей."
    },
    {
        "number": 80,
        "title": "Доступность интерфейсов. Лекция Яндекса",
        "author": "batogov",
        "link": "https://habr.com/en/companies/yandex/articles/424879/",
        "annotation": "Меня зовут Дима, я работаю в офисе Яндекса в Санкт-Петербурге и занимаюсь внутренними сервисами в команде разработки интерфейсов Толоки. В этом году я подготовил лекцию для Школы разработки интерфейсов. Ниже — её расшифровка.\n\r\nЧто такое доступность интерфейсов? Для кого она важна и зачем к ней нужно стремиться? Каковы основные приемы, которые делают интерфейс доступным? Кроме этих вопросов, лекция проясняет принципы, которые лежат в основе ассистивных технологий. Я постарался разобрать теорию и большое количество практических примеров, а также показать процесс работы скринридера.\n\n\r\n— Что скрывается под модным нынче термином accessibility? Какие у вас есть варианты? Для слепых, чтение с экрана, с ограниченными возможностями, координация движений… Все верно. Доступность — возможность использования интерфейса всеми, независимо от физических или технических ограничений."
    },
    {
        "number": 81,
        "title": "200 лет шрифту Брайля: как себя сегодня чувствуют ассистивные технологии в сети?",
        "author": "olegantipovDDG",
        "link": "https://habr.com/en/companies/ddosguard/articles/822625/",
        "annotation": "В 1824 году 15-летний незрячий французский мальчик Луи Брайль изобрел рельефный шрифт, которым сегодня пользуются люди с нарушениями зрения по всему миру. Так появилась первая полноценная ассистивная технология в истории. В этой статье я расскажу, какие еще технологии подобного рода у нас есть сегодня в цифровом мире — в котором так многое зависит от способности видеть, читать и кликать."
    },
    {
        "number": 82,
        "title": "Изменить цвета и кнопки сервиса — и не сломать дизайн-систему",
        "author": "Alexeyafonin",
        "link": "https://habr.com/en/companies/yandex_cloud_and_infra/articles/804941/",
        "annotation": "Меня зовут Алексей Афонин, я старший дизайнер продукта в Yandex Cloud. В прошлом году нам понадобилось полностью изменить внешний вид нашего сервиса для бизнес‑аналитики DataLens перед его выходом в опенсорс. Разработчики и дизайнеры интерфейсов часто сталкиваются с подобными задачами: есть уже работающий сервис, но его нужно стилизовать, например, в случае ребрендинга или при необходимости учесть специфический пользовательский опыт. В наших продуктах мы пользуемся дизайн‑системой и библиотекой компонентов Gravity UI — это проект Yandex Cloud, который не так давно тоже вышел в опенсорс. В этой статье я поделюсь опытом, как мы решили задачу «перекрашивания DataLens» с её помощью. Но даже если вы не используете DataLens и ещё не знакомы с Gravity UI, наши наработки могут пригодиться командам разработчиков и дизайнеров, которые хотят стилизовать свои продукты быстрее и удобнее."
    },
    {
        "number": 83,
        "title": "Доступность интерфейсов. Лекция Яндекса",
        "author": "batogov",
        "link": "https://habr.com/en/companies/yandex/articles/424879/",
        "annotation": "Меня зовут Дима, я работаю в офисе Яндекса в Санкт-Петербурге и занимаюсь внутренними сервисами в команде разработки интерфейсов Толоки. В этом году я подготовил лекцию для Школы разработки интерфейсов. Ниже — её расшифровка.\n\r\nЧто такое доступность интерфейсов? Для кого она важна и зачем к ней нужно стремиться? Каковы основные приемы, которые делают интерфейс доступным? Кроме этих вопросов, лекция проясняет принципы, которые лежат в основе ассистивных технологий. Я постарался разобрать теорию и большое количество практических примеров, а также показать процесс работы скринридера.\n\n\r\n— Что скрывается под модным нынче термином accessibility? Какие у вас есть варианты? Для слепых, чтение с экрана, с ограниченными возможностями, координация движений… Все верно. Доступность — возможность использования интерфейса всеми, независимо от физических или технических ограничений."
    },
    {
        "number": 84,
        "title": "Доступный toggle",
        "author": "MaxRokatansky",
        "link": "https://habr.com/en/companies/otus/articles/557006/",
        "annotation": "Toggles (или их еще называют \"тумблеры\"/\"переключатели\") широко используются в современных интерфейсах. Они, как правило, относительно просты, и их можно рассматривать как простые флажки (checkbox). Тем не менее, их часто делают недоступными тем или иным способом.В этой статье я покажу небольшую имплементацию доступного toggle на HTML + CSS, которую вы можете применить в своих проектах и доработать по своему усмотрению."
    },
    {
        "number": 85,
        "title": "Как мы делали совершенно новый КОМПАС-3D: История в семи главах → часть 2",
        "author": "kompas_3d",
        "link": "https://habr.com/en/companies/ascon/articles/326886/",
        "annotation": "Продолжение. Ссылка на первую часть (Осторожно, трафик!).\n\n\n\r\nПродолжаем разбирать по полочкам революционный интерфейс CAD-системы КОМПАС-3D v17. В первой части наш проектировщик интерфейсов Сергей Швецов рассказал, с какими задачами столкнулась команда, с какими задачами столкнулись при разработке нового дизайна. Если вы не понимаете, откуда цитаты или не знаете спецтерминов — добро пожаловать в первую часть материала!\n\nОсторожно, трафик!"
    },
    {
        "number": 86,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №470 (1 — 6 июня 2021)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/561334/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 87,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №434 (21 — 27 сентября 2020)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/520890/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 88,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №438 (19 — 25 октября 2020)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/525008/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 89,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №439 (26 — 31 октября 2020)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/526032/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 90,
        "title": "Дайджест интересных новостей и материалов из мира айти за последнюю неделю №27 (13 — 19 октября 2012)",
        "author": "alexzfort",
        "link": "https://habr.com/en/companies/zfort/articles/155431/",
        "annotation": "Предлагаем вашему вниманию очередную подборку с ссылками на новости, интересные материалы и полезные ресурсы."
    },
    {
        "number": 91,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №446 (14 — 20 декабря 2020)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/534124/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 92,
        "title": "Юзабилити Бюллетень. Выпуск № 25",
        "author": "dmitrysatin",
        "link": "https://habr.com/en/articles/44770/",
        "annotation": "Итоги User Experience Russia'08: Фотографии и немного цифр | UPA Russia и USABILITYLAB готовят конференцию “Accessibility для бизнеса” | Резонанс User Experience Russia'08 в Сети | WUD, Transportation: ТОР-5 мега-юзабельных знаков | Портрет пользователя интернет-магазина | Web 2.0 снова наступает"
    },
    {
        "number": 93,
        "title": "Дайджест свежих материалов из мира фронтенда за последнюю неделю №452 (25 — 31 января 2021)",
        "author": "alexzfort",
        "link": "https://habr.com/en/articles/540202/",
        "annotation": "Предлагаем вашему вниманию подборку с ссылками на новые материалы из области фронтенда и около него."
    },
    {
        "number": 94,
        "title": "Дайджест интересных новостей и материалов из мира айти за последнюю неделю №46 (23 февраля — 1 марта 2013)",
        "author": "alexzfort",
        "link": "https://habr.com/en/companies/zfort/articles/171315/",
        "annotation": "Предлагаем вашему вниманию очередную подборку с ссылками на новости, интересные материалы и полезные ресурсы."
    },
    {
        "number": 95,
        "title": "Плохие интерфейсы, или как я ходила на башню Федерация",
        "author": "elena_zorina",
        "link": "https://habr.com/en/companies/directum/articles/544912/",
        "annotation": "Часто пишут про тяжёлые, неудобные UI программных продуктов. Но с интерфейсами мы сталкиваемся не только при работе за компьютером, но и в физическом мире.Я разработчик системы Directum, занимаюсь разработкой прикладных решений. В мои задачи входит среди прочего и проектирование пользовательского интерфейса. Кроме того, я живу жизнь, люблю бывать во всяких интересных местах, и профессиональная деформация делает посещение таких мест еще интереснее.Это будет рассказ о личном опыте посещении смотровой площадки башни «Федерация» в новогодние праздники 2021 и наблюдения UI этой самой смотровой площадки. \"Федерация\" - это комплекс зданий в Москва-сити, включающий 2 башни: Восток и Запад. Башня Восток является вторым по высоте зданием в Европе. Его высота составляет 374 метра и 95 этажей. На 89 этаже располагается открытая для посещения смотровая площадка PANORAMA360.Куда я и направилась, приехав в столицу в новогодние праздники и решив насладиться её видами с высоты. Но для этого мне пришлось преодолеть: непонимание, потерянность, обречённость, томительное ожидание и жгучее раздражение. Все эти яркие чувства вызвала во мне организация доступа к смотровой площадке, то есть - интерфейс. И своим опытом преодоления я хочу поделиться с вами."
    },
    {
        "number": 96,
        "title": "Руководство по цвету в UX/UI-дизайне",
        "author": "alconost",
        "link": "https://habr.com/en/companies/alconost/articles/565438/",
        "annotation": "Цвет — одна из важнейших составляющих UI-дизайна. Благодаря цвету один и тот же продукт может казаться сложным и крутым или сумасшедшим. И задача дизайнера здесь — не найти и смешать красивые цвета, а создать определенную систему. В этой статье мы начнем с основ и постепенно дойдем до профессионального уровня."
    },
    {
        "number": 97,
        "title": "Обзор свежих материалов, июль-сентябрь 2012",
        "author": "jvetrau",
        "link": "https://habr.com/en/articles/157077/",
        "annotation": "Этот материал продолжает серию ежемесячных обзоров свежих статей по теме интерфейсов, новых инструментов и коллекций паттернов, интересных кейсов и исторических рассказов. Из лент нескольких сотен тематических подписок отбирается примерно 5% стоящих публикаций, которыми интересно поделиться. Предыдущие материалы: апрель 2010-июнь 2012."
    },
    {
        "number": 98,
        "title": "Сервис трекинга Почты России уподобился китайскому коллеге",
        "author": "coocheenin",
        "link": "https://habr.com/en/articles/158631/",
        "annotation": "Сегодня на сайте нашей любимой «Почты России» появилась капча. Это означает, что забирать информацию по почтовым отправлениям простым POST-запросом больше не получится. Как следствие, многочисленные сервисы «Где моя посылка?» потеряют (на время, скорее всего) немалую часть своей аудитории.\n\r\nСуществует, конечно полусекретный SOAP API о примере использования которого рассказал уважаемый qnub, но было бы логично ожидать, что теперь сделают новый полноценный документированный API. Вопрос: сколько придётся этого ждать?\n\r\nА пока что сервис отслеживания Почты России стал таким же как у братьев-китайцев — медленным и неудобным для конечного пользователя."
    },
    {
        "number": 99,
        "title": "6 хороших практик по HTML и CSS",
        "author": "melnik909",
        "link": "https://habr.com/en/articles/571828/",
        "annotation": "Можно легко найти хорошие практики по любой технологии, но, к сожалению, по HTML и CSS это сделать не так просто. Недолго думая, я написал свой список из 6 кейсов, когда вы можете сделать удобный или не удобный интерфейс для пользователя только через HTML и CSS."
    },
    {
        "number": 100,
        "title": "Фронтенд-новости №9. Конец эпохи IE, 19 лет Wordpress, цветовые тренды 2022",
        "author": "nikolayshabalin",
        "link": "https://habr.com/en/companies/htmlacademy/articles/669738/",
        "annotation": "Дайджест новостей и полезных статей из мира фронтенд-разработки за последнюю неделю 30 мая–05 июня."
    }
]